
#Использовать asserts
#Использовать ".."

Функция ПолучитьСписокТестов(Знач ЮнитТестирование) Экспорт

	МассивТестов = Новый Массив;	
	МассивТестов.Добавить("Тест_ПутьПоИмениФайла_ТестовыеДанные");
    МассивТестов.Добавить("Тест_ПутьПоИмениФайла_РеальныеДанныеВоВременномКаталоге");
	МассивТестов.Добавить("Тест_РазворачиваниеТекущегоКаталога");

	Возврат МассивТестов;

КонецФункции

Процедура ПередЗапускомТеста() Экспорт
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
КонецПроцедуры

Процедура Тест_ПутьПоИмениФайла_ТестовыеДанные() Экспорт
	
    Конвертер = Новый КонвертерИмяФайла;		
	Конвертер.УстановитьКаталогБинарников("d:\prod\bin");
	Конвертер.УстановитьКаталогИсходников("d:\prod\src\");

    ПроверитьПреобразованиеИмениВПуть(Конвертер, "d:\prod\bin\123.ert", "d:\prod\src\123_ert");
    ПроверитьПреобразованиеИмениВПуть(Конвертер, "d:\prod\bin\1Cv7.md",     "d:\prod\src\1Cv7_md");
	ПроверитьПреобразованиеИмениВПуть(Конвертер, "d:\prod\bin\123.321.ert", "d:\prod\src\123_321_ert");
    
КонецПроцедуры

Процедура Тест_ПутьПоИмениФайла_РеальныеДанныеВоВременномКаталоге() Экспорт
    
    Конвертер = Новый КонвертерИмяФайла;		
	Конвертер.УстановитьКаталогБинарников("C:\Users\degalevich_aa\AppData\Local\Temp\f1hhf1al.uww.tmp");
	Конвертер.УстановитьКаталогИсходников("C:\Users\degalevich_aa\AppData\Local\Temp\hym3zji0.l5h.tmp");

    ПроверитьПреобразованиеИмениВПуть(
        Конвертер, 
        "C:\Users\degalevich_aa\AppData\Local\Temp\f1hhf1al.uww.tmp\sample.proc1.ert", 
        "C:\Users\degalevich_aa\AppData\Local\Temp\hym3zji0.l5h.tmp\sample_proc1_ert");

КонецПроцедуры // ИмяПроцедуры()

Процедура Тест_РазворачиваниеТекущегоКаталога() Экспорт

	ТекКаталог = ТекущийКаталог();

	Конвертер = Новый КонвертерИмяФайла;		
	Конвертер.УстановитьКаталогБинарников(".");	// тек. каталог
	Конвертер.УстановитьКаталогИсходников("src");

	ПроверитьПреобразованиеИмениВПуть(Конвертер, ОбъединитьПути(ТекКаталог, "123.444.ert"), ОбъединитьПути(ТекКаталог, "src", "123_444_ert"));

КонецПроцедуры

Процедура ПроверитьПреобразованиеИмениВПуть(пКонвертер, пИмяФайла, пИскомыйКаталогИсходников);

    Ожидаем.Что(пКонвертер.ПутьКИсходникам(пИмяФайла), "Имя файла: <" + пИмяФайла + ">").Равно(пИскомыйКаталогИсходников);

КонецПроцедуры
