
#Использовать asserts
#Использовать ".."

Функция ПолучитьСписокТестов(Знач ЮнитТестирование) Экспорт

	МассивТестов = Новый Массив;	
	МассивТестов.Добавить("Тест_ОбъединитьПути");
	МассивТестов.Добавить("Тест_РазворачиваниеТекущегоКаталога");
	МассивТестов.Добавить("Тест_ДобавлениеТекущегоКаталога");
	МассивТестов.Добавить("Тест_УдалениеХвостовогоРазделителя");
    
	Возврат МассивТестов;

КонецФункции

Процедура ПередЗапускомТеста() Экспорт
	//мМодульПодготовки = 
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
КонецПроцедуры

Процедура Тест_ОбъединитьПути() Экспорт
	
	Ожидаем.Что(ОбъединитьПути("d:\", "dir")).Равно("d:\dir");

	// вот это неочевидное поведение как мне кажется 
	Ожидаем.Что(ОбъединитьПути("d:", "dir")).Равно("d:dir");
	Ожидаем.Что(ОбъединитьПути("d:", "\dir")).Равно("\dir");

КонецПроцедуры

Процедура Тест_РазворачиваниеТекущегоКаталога() Экспорт
	ПроверитьПреобразование(".", ТекущийКаталог());
    ПроверитьПреобразование(".\dir", ОбъединитьПути(ТекущийКаталог(), "dir"));
    ПроверитьПреобразование(".\НоваяПапка", ОбъединитьПути(ТекущийКаталог(), "НоваяПапка"));
    ПроверитьПреобразование(".\Вложенная\Папка", ОбъединитьПути(ТекущийКаталог(), "Вложенная\Папка"));
КонецПроцедуры

Процедура Тест_ДобавлениеТекущегоКаталога() Экспорт
	ПроверитьПреобразование("src", ОбъединитьПути(ТекущийКаталог(),"src"));
	ПроверитьПреобразование("Вложенная\Папка", ОбъединитьПути(ТекущийКаталог(),"Вложенная\Папка"));
КонецПроцедуры

Процедура Тест_УдалениеХвостовогоРазделителя() Экспорт
	ПроверитьПреобразование("d:\src\", "d:\src");
КонецПроцедуры

Процедура ПроверитьПреобразование(Знач пКаталог, Знач пРезультат, Знач пСообщениеОбОшибке = "")
    пСообщениеОбОшибке = пСообщениеОбОшибке + ?(ПустаяСтрока(пСообщениеОбОшибке), "", "\n") + "Исходное представление каталога: <" + пКаталог + ">";
    Ожидаем.Что(ПодготовкаИмениКаталога.Откорректировать(пКаталог), пСообщениеОбОшибке).Равно(пРезультат);
КонецПроцедуры
