# language: ru

Функциональность: Распаковка каталога

Как разработчик
Я хочу иметь возможность распаковывать на исходники все бинарные файлы 1С 7.7, расположенны в указанном каталоге
Чтобы иметь исходные коды проекта

Контекст:
Допустим Я создаю временный каталог бинарников и сохраняю его в контекст
    И я создаю другой временный каталог для исходников и сохраняю его в контекст
    
Сценарий: Перекодировка пустого каталога
    Допустим каталог бинарников пустой
    Когда я выполняю команду распаковки бинарников
    Тогда каталог исходников пустой